Feature: Запис на посещение

  Scenario Outline: Запис на посещение
    Given Ветеринарят избира нов запис
    When въведе идентификационен номер <номер>
    And въведе диагноза <диагноза>
    And въведе лечение <лечение>
    And натисне бутона за добавяне
    Then вижда съобщение <съобщение>
    Examples:
      | номер | диагноза | лечение | съобщение |
      | "2658377503" | "Пневмония" | "лечение" | "Успешно добавяне на запис на посещение." |
      | "2658377503" | "фжвхайфвафквхсйвярйккйсдгкнхирвхярхвихксдйглдйскасдк" | "лечение" | "Диагнозата е прекалено дълга (до 50 символа)." |
      | "" | "Пневмония" | "лечение" | "Попълнете идентификационен номер на животното." |
      | "2658377503" | "" | "лечение" | "Попълнете диагноза на животното." |
      | "2658377503" | "Пневмония" | "" | "Попълнете лечение за животното." |
      | "2658377503" | "Пневмония" | "лечение@$№$%€§" | "Полето лечение може да съдържа само текст." |
      | "2658377503" | "Пневмония%€" | "лечение" | "Диагнозата може да съдържа само текст." |
      | "2658377503" | "Пневмония" | "лечениефжвхайфвафквхсйвярйккйсдгквхайфвафквхсвхайфвафквхсйвярйккйсдгкнхирвхяйвярйккйсдгкнхирвхянхирвхярхвихксдйглдйскасдк" | "Полето лечение е прекалено дълго (до 100 символа)." |
